Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType
ConceptualConstructionType values for Shades.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType.NumShadeTypeConstruction
Total Number of Shade Type Constructions

Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType.BasicShade
Basic Shade

Autodesk.Revit.DB.Analysis.ConceptualConstructionShadeType.InvalidShadeTypeConstruction
Invalid value/not set Shade Type Construction